<h1 align="center">Data Preprocessing using Pandas Exercises</h1>
<h1 align="center">Exam Dictionary data and List labels</h1>

<h3>Import Necessary Packages</h3>

In [3]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

<h3>By using the given Exam Dataset, Execute the following tasks</h3>

In [5]:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

<h3>1. Write a Python program to create and display a DataFrame from a specified dictionary data which has the index labels.</h3>

In [7]:
df = pd.DataFrame(exam_data, index=labels)
df

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

<h3>2. Write a Python program to display a summary of the basic information about a specified DataFrame and its data.</h3>

In [9]:
df.info()
df.describe()

<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, a to j
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   name      10 non-null     object
 1   score     8 non-null      float64
 2   attempts  10 non-null     int64
 3   qualify   10 non-null     object
dtypes: float64(1), int64(1), object(2)
memory usage: 400.0+ bytes

           score   attempts
count   8.000000  10.000000
mean   13.562500   1.900000
std     4.693746   0.875595
min     8.000000   1.000000
25%     9.000000   1.000000
50%    13.500000   2.000000
75%    17.125000   2.750000
max    20.000000   3.000000

<h3>3. Write a Python program to get the first 3 rows of a given DataFrame. </h3>

In [11]:
df.head(3)

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes

<h3>4. Write a Python program to select the 'name' and 'score' columns from the following DataFrame. </h3>

In [13]:
df[['name', 'score']]

        name  score
a  Anastasia   12.5
b       Dima    9.0
c  Katherine   16.5
d      James    NaN
e      Emily    9.0
f    Michael   20.0
g    Matthew   14.5
h      Laura    NaN
i      Kevin    8.0
j      Jonas   19.0

<h3>5. Write a Python program to select the specified columns and rows from a given data frame. </h3>

In [15]:
df.loc[['b','d','g'],['name', 'score']]

      name  score
b     Dima    9.0
d    James    NaN
g  Matthew   14.5

<h3>6. Write a Python program to select the rows where the number of attempts in the examination is greater than 2. </h3>

In [17]:
df[df['attempts'] > 2]

      name  score  attempts qualify
b     Dima    9.0         3      no
d    James    NaN         3      no
f  Michael   20.0         3     yes

<h3>7. Write a Python program to count the number of rows and columns of a DataFrame. </h3>

In [19]:
df.shape

(10, 4)

<h3>8. Write a Python program to select the rows where the score is missing, i.e. is NaN. </h3>

In [21]:
df[df['score'].isna()]

    name  score  attempts qualify
d  James    NaN         3      no
h  Laura    NaN         1      no

<h3>9. Write a Python program to select the rows the score is between 15 and 20 (inclusive). </h3>

In [23]:
df[df['score'].between(15,20)]

        name  score  attempts qualify
c  Katherine   16.5         2     yes
f    Michael   20.0         3     yes
j      Jonas   19.0         1     yes

<h3>10. Write a Python program to select the rows where number of attempts in the examination is less than 2 and score greater than 15.</h3>

In [25]:
df[(df['score'].isna()) & (df['attempts'] < 2)]

    name  score  attempts qualify
h  Laura    NaN         1      no

<h3>11. Write a Python program to change the score in row 'd' to 11.5. </h3>

In [27]:
df.loc['d','score'] = 11.5
df

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James   11.5         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

<h3>12. Write a Python program to calculate the sum of the examination attempts by the students. </h3>

In [29]:
df['attempts'].sum()

19

<h3>13. Write a Python program to calculate the mean score for each different student in DataFrame. </h3>

In [31]:
df['score'].mean()

13.333333333333334

<h3>14. Write a Python program to append a new row 'k' to data frame with given values for each column. Now delete the new row and return the original DataFrame. </h3>

In [33]:
df.loc['k'] = ['Kumar', 19,2,'yes'] 
df

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James   11.5         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes
k      Kumar   19.0         2     yes

In [34]:
df.drop('k', inplace=True)

df

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James   11.5         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

<h3>15. Write a Python program to sort the DataFrame first by 'name' in descending order, then by 'score' in ascending order. </h3>

In [36]:
df_sorted = df.sort_values(by=['name', 'score'], ascending=[False, True])
df_sorted

        name  score  attempts qualify
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
c  Katherine   16.5         2     yes
j      Jonas   19.0         1     yes
d      James   11.5         3      no
e      Emily    9.0         2      no
b       Dima    9.0         3      no
a  Anastasia   12.5         1     yes

<h3>16. Write a Python program to replace the 'qualify' column contains the values 'yes' and 'no' with True and False.</h3>

In [38]:
df['qualify'] = df['qualify'].map({'yes':True, 'no':False})

df

        name  score  attempts  qualify
a  Anastasia   12.5         1     True
b       Dima    9.0         3    False
c  Katherine   16.5         2     True
d      James   11.5         3    False
e      Emily    9.0         2    False
f    Michael   20.0         3     True
g    Matthew   14.5         1     True
h      Laura    NaN         1    False
i      Kevin    8.0         2    False
j      Jonas   19.0         1     True

<h3>17. Write a Python program to change the name 'James' to 'Suresh' in name column of the DataFrame.</h3>

In [40]:
df['name'] = df['name'].replace('James', 'Suresh')

df

        name  score  attempts  qualify
a  Anastasia   12.5         1     True
b       Dima    9.0         3    False
c  Katherine   16.5         2     True
d     Suresh   11.5         3    False
e      Emily    9.0         2    False
f    Michael   20.0         3     True
g    Matthew   14.5         1     True
h      Laura    NaN         1    False
i      Kevin    8.0         2    False
j      Jonas   19.0         1     True

<h3>18. Write a Python program to delete the 'attempts' column from the DataFrame.</h3>

In [42]:
df.drop(columns=['attempts'], inplace = True)

<h3>19. Write a Python program to insert a new column in existing DataFrame.</h3>

In [44]:
df['age'] = [20, 21, 19, 18, 20, 19, 22, 21, 20, 18]

df

        name  score  qualify  age
a  Anastasia   12.5     True   20
b       Dima    9.0    False   21
c  Katherine   16.5     True   19
d     Suresh   11.5    False   18
e      Emily    9.0    False   20
f    Michael   20.0     True   19
g    Matthew   14.5     True   22
h      Laura    NaN    False   21
i      Kevin    8.0    False   20
j      Jonas   19.0     True   18

<h3>20. Write a Python program to iterate over rows in a DataFrame.</h3>

In [46]:
for index,row in df.iterrows():
    print(f"Index: {index}, Name: {row['name']}, Score: {row['score']}")

Index: a, Name: Anastasia, Score: 12.5
Index: b, Name: Dima, Score: 9.0
Index: c, Name: Katherine, Score: 16.5
Index: d, Name: Suresh, Score: 11.5
Index: e, Name: Emily, Score: 9.0
Index: f, Name: Michael, Score: 20.0
Index: g, Name: Matthew, Score: 14.5
Index: h, Name: Laura, Score: nan
Index: i, Name: Kevin, Score: 8.0
Index: j, Name: Jonas, Score: 19.0

<h3>21. Write a Python program to get list from DataFrame column headers.</h3>

In [48]:
df.columns.tolist()

['name', 'score', 'qualify', 'age']